In [36]:
import pandas as pd
print("Version: ",pd.__version__)

Version:  2.2.3

In [37]:
list = [1,9,4,29,54,89,20]
myseries = pd.Series(list)
print(myseries)
print("Element at index 3: ", myseries[3])

0     1
1     9
2     4
3    29
4    54
5    89
6    20
dtype: int64
Element at index 3:  29

In [38]:
import pandas as pd
a =[1,3,5]
myvar = pd.Series(a,index=['a','b','c'])
print(myvar)
print(myvar['b'])

a    1
b    3
c    5
dtype: int64
3

In [39]:
employee = {
    "id":1,
    "name":"John",
    "email":"abc@gmail.com",
    "address":"123,abc street,xyz city",
    "salary":10000 
}
data = pd.Series(employee)
print(data)
print("id: ",data['id'])
print("name: ",data['name'])

id                               1
name                          John
email                abc@gmail.com
address    123,abc street,xyz city
salary                       10000
dtype: object
id:  1
name:  John

In [40]:
sample={
    "id":[1,2,3,4],
    "name":["John","Doe","Jane","Smith"],
    "city":["New York","Los Angeles","Chicago","Houston"]
}
df = pd.DataFrame(sample)
print(df)

   id   name         city
0   1   John     New York
1   2    Doe  Los Angeles
2   3   Jane      Chicago
3   4  Smith      Houston

In [41]:
import pandas as pd
data = {
    "id":[1,2,3,4],
    "name":["John","Doe","Jane","Smith"],
    "city":["New York","Los Angeles","Chicago","Houston"]
}
df = pd.DataFrame(data)
print(df)
print("First row:\n ",df.loc[0]) # first row
print(df.loc[[0,1]])    # first and second row
print(df.iloc[0,1])  # 0th row and 1st column

   id   name         city
0   1   John     New York
1   2    Doe  Los Angeles
2   3   Jane      Chicago
3   4  Smith      Houston
First row:
  id             1
name        John
city    New York
Name: 0, dtype: object
   id  name         city
0   1  John     New York
1   2   Doe  Los Angeles
John

In [42]:
import pandas as pd
data = {
    "id":[1,2,3,4],
    "name":["John","Doe","Jane","Smith"],
    "city":["New York","Los Angeles","Chicago","Houston"],
    "email":["abc@gmail.com","cat@gmail.com","bob@gmail.com"]
}
df = pd.DataFrame(data,columns=["name","city","id"])
print(df)

    name         city  id
0   John     New York   1
1    Doe  Los Angeles   2
2   Jane      Chicago   3
3  Smith      Houston   4

In [43]:
import pandas as pd
data = [
    ["Alice",25,"New York"],
    ["Bob",30,"Los Angeles"],
    ["Charlie",35,"Chicago"],
    ["David",40,"Houston"]
]
df = pd.DataFrame(data,columns=["Name","Age","City"])
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [44]:
student_data = pd.read_csv("MOCK_DATA.csv")  
#converted to string
print(student_data)

# print first 3 rows
student_data.head(3)

     id              name                       email    gender  percentage
0     1     Chariot Jopke            cjopke0@ucsd.edu      Male         6.7
1     2        Zorana Dan            zdan1@oracle.com    Female         6.3
2     3       Kurt Rumble           krumble2@tamu.edu      Male         6.9
3     4     Ethyl Yandell      eyandell3@bluehost.com    Female         6.4
4     5    Aeriela Bolzen          abolzen4@lycos.com    Female         6.5
..  ...               ...                         ...       ...         ...
95   96   Meagan Douglass  mdouglass2n@friendfeed.com  Bigender         9.1
96   97     Riccardo Asty         rasty2o@cornell.edu      Male         6.2
97   98     Karoly Chiese        kchiese2p@dyndns.org      Male         6.0
98   99    Raquel Kerrane    rkerrane2q@geocities.com    Female         1.5
99  100  Jenifer Farrants         jfarrants2r@cmu.edu    Female         4.0

[100 rows x 5 columns]

   id           name              email  gender  percentage
0   1  Chariot Jopke   cjopke0@ucsd.edu    Male         6.7
1   2     Zorana Dan   zdan1@oracle.com  Female         6.3
2   3    Kurt Rumble  krumble2@tamu.edu    Male         6.9

In [45]:
print(student_data.to_string())

     id                    name                            email       gender  percentage
0     1           Chariot Jopke                 cjopke0@ucsd.edu         Male         6.7
1     2              Zorana Dan                 zdan1@oracle.com       Female         6.3
2     3             Kurt Rumble                krumble2@tamu.edu         Male         6.9
3     4           Ethyl Yandell           eyandell3@bluehost.com       Female         6.4
4     5          Aeriela Bolzen               abolzen4@lycos.com       Female         6.5
5     6         Junette Audritt                jaudritt5@mail.ru       Female         4.5
6     7    Valentino Skillicorn      vskillicorn6@shutterfly.com         Male         7.2
7     8           Tuesday Gogie          tgogie7@photobucket.com       Female         6.1
8     9             Rowena Brum                    rbrum8@hp.com       Female         3.9
9    10        Cathlene Snedker          csnedker9@geocities.com       Female         2.7
10   11       Carleton Le Friec             clea@stumbleupon.com         Male         7.3
11   12           Madge Yarnell                myarnellb@pbs.org   Polygender         8.3
12   13         Jacinthe Cooley                 jcooleyc@ihg.com       Female         6.7
13   14            Garrott Garm          ggarmd@wunderground.com         Male         7.9
14   15          Robers Barnett           rbarnette@hubpages.com         Male         7.5
15   16         Catarina Tabard                 ctabardf@soup.io       Female         7.7
16   17            Daisy Tomley         dtomleyg@miibeian.gov.cn   Polygender         5.1
17   18         Lara Simoneschi             lsimoneschih@php.net   Polygender         1.0
18   19           Earvin Romand        eromandi@chronoengine.com         Male         9.6
19   20          Jared Vickress              jvickressj@wisc.edu         Male         1.0
20   21          Clarey Straker           cstrakerk@hatena.ne.jp       Female         9.5
21   22           Merrie Croote         mcrootel@dailymotion.com       Female         1.1
22   23           Karoly Fulker             kfulkerm@comcast.net       Female         5.5
23   24         Clayson Carding                ccardingn@pbs.org         Male         9.6
24   25          Nelia Palffrey     npalffreyo@deliciousdays.com       Female         5.4
25   26            Hersh Baxill                  hbaxillp@i2i.jp         Male         1.1
26   27              Moyna Neal               mnealq@spotify.com       Female         1.7
27   28             Shae Treece               streecer@globo.com         Male         3.6
28   29          Sonni Shepeard                sshepeards@gov.uk       Female         3.6
29   30        Gaspar Phinnessy            gphinnessyt@prweb.com         Male         8.9
30   31           Anita Speddin         aspeddinu@purevolume.com       Female         4.3
31   32           Isa Janosevic               ijanosevicv@va.gov         Male         3.3
32   33            Addy Labarre           alabarrew@yolasite.com         Male         4.9
33   34        Whitman Strachan               wstrachanx@usa.gov         Male         9.8
34   35         Norah Christofe                nchristofey@51.la       Female         5.2
35   36  Anne-corinne MacCathay            amaccathayz@patch.com       Female         4.0
36   37         Sherilyn Fassan             sfassan10@ustream.tv   Non-binary         1.4
37   38          Maryanne Phaup           mphaup11@google.com.au       Female         6.9
38   39             Drud Sunman       dsunman12@biblegateway.com         Male         3.5
39   40       Crichton Whitnell            cwhitnell13@topsy.com         Male         1.6
40   41         Livia Delbergue    ldelbergue14@wunderground.com       Female         3.9
41   42          Shelba Fawdrey             sfawdrey15@naver.com       Female         4.6
42   43           Major Burnell           mburnell16@vinaora.com         Male         3.1
43   44         Neill Clitherow     nclitherow17@marketwatch.com         Male         3.9
44   45            Shadow Hadny                shadny18@gmpg.org         Male         7.3
45   46      Florida Sharphouse      fsharphouse19@angelfire.com       Female         5.5
46   47         Demott Spancock            dspancock1a@cisco.com     Bigender         2.7
47   48        Marchelle Labone        mlabone1b@liveinternet.ru  Genderqueer         7.4
48   49            Brit Sancias        bsancias1c@soundcloud.com         Male         3.5
49   50        Roderick Sellens              rsellens1d@army.mil         Male         7.5
50   51            Sallee Mathe             smathe1e@histats.com       Female         2.2
51   52            Bunny Sturch                bsturch1f@unc.edu       Female         5.8
52   53           Burty Epelett            bepelett1g@apache.org         Male         9.6
53   54             Dirk Firmin              dfirmin1h@diigo.com         Male         7.4
54   55                Ema Dank                  edank1i@soup.io       Female         3.4
55   56           Mikel Kemmett           mkemmett1j@oaic.gov.au         Male         7.1
56   57             Thom Forsey             tforsey1k@unicef.org         Male         4.3
57   58       Mellisent Sculley              msculley1l@usda.gov      Agender         2.5
58   59          Kelcy Stendell             kstendell1m@dell.com       Female         6.4
59   60         Nowell Elletson         nelletson1n@freewebs.com         Male         2.0
60   61           Ivonne Beseke                  ibeseke1o@ow.ly       Female         4.1
61   62           Reuben Dowyer           rdowyer1p@illinois.edu         Male         4.7
62   63       Sybille Shilburne          sshilburne1q@zimbio.com       Female         6.1
63   64            Kattie Booty               kbooty1r@cisco.com       Female         5.5
64   65          Wilhelm Founds              wfounds1s@about.com         Male         5.0
65   66            Lusa Hamshaw             lhamshaw1t@ifeng.com       Female         1.2
66   67             Paola Evemy      pevemy1u@simplemachines.org       Female         9.2
67   68           Wally Ornells           wornells1v@twitpic.com  Genderfluid         6.6
68   69        Derrik Cambridge              dcambridge1w@wp.com         Male         2.0
69   70          Northrop Buggy        nbuggy1x@sciencedaily.com         Male         4.5
70   71          Idell Weathers          iweathers1y@webnode.com   Polygender         4.8
71   72        Florenza MacAree             fmacaree1z@webmd.com       Female         4.9
72   73            Hamish Newby         hnewby20@list-manage.com         Male         1.6
73   74           Mirilla Piser                 mpiser21@who.int       Female         8.3
74   75          Florenza Moody         fmoody22@statcounter.com       Female         2.0
75   76         Willamina Ervin                 wervin23@tiny.cc       Female         7.0
76   77         Humfrey Duberry              hduberry24@ehow.com   Non-binary         6.3
77   78           Irene Avraham         iavraham25@csmonitor.com       Female         1.7
78   79        Kienan Strathman          kstrathman26@netlog.com         Male         7.2
79   80         Hasty MacGaughy         hmacgaughy27@blogger.com   Non-binary         5.1
80   81          Devland Plante        dplante28@sourceforge.net         Male         3.8
81   82          Sigvard Mullan              smullan29@exblog.jp         Male         9.6
82   83        Hedvig Fritchley          hfritchley2a@scribd.com       Female         1.1
83   84                Vin Sant          vsant2b@photobucket.com       Female         2.1
84   85              Jerrie Vaz                  jvaz2c@ebay.com  Genderfluid         6.0
85   86          Perkin Zanetti        pzanetti2d@mayoclinic.com         Male         5.6
86   87           Holly Passman            hpassman2e@jalbum.net       Female         6.6
87   88        Aguistin Kohtler           akohtler2f@auda.org.au         Male         8.0
88   89             Paige Boyer               pboyer2g@opera.com       Female         4.1
89   90        Albert Whittaker    awhittaker2h@businesswire.com         Male         9.9
90   91         Bartel Gawkroge      bgawkroge2i@squarespace.com         Male         3.2
91   92          Raina Pothbury         rpothbury2j@sakura.ne.jp       Female         5.8
92   93      Maridel O'Mullally  momullally2k@washingtonpost.com       Female         2.1
93   94           Erek Brandone        ebrandone2l@blinklist.com         Male         7.9
94   95          Christi Livard                clivard2m@icq.com     Bigender         8.8
95   96         Meagan Douglass       mdouglass2n@friendfeed.com     Bigender         9.1
96   97           Riccardo Asty              rasty2o@cornell.edu         Male         6.2
97   98           Karoly Chiese             kchiese2p@dyndns.org         Male         6.0
98   99          Raquel Kerrane         rkerrane2q@geocities.com       Female         1.5
99  100        Jenifer Farrants              jfarrants2r@cmu.edu       Female         4.0

In [46]:
print(student_data.tail(3))

     id              name                     email  gender  percentage
97   98     Karoly Chiese      kchiese2p@dyndns.org    Male         6.0
98   99    Raquel Kerrane  rkerrane2q@geocities.com  Female         1.5
99  100  Jenifer Farrants       jfarrants2r@cmu.edu  Female         4.0

In [47]:
print(student_data.shape)

(100, 5)

In [48]:
print(student_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          100 non-null    int64
 1   name        100 non-null    object
 2   email       100 non-null    object
 3   gender      100 non-null    object
 4   percentage  100 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 4.0+ KB
None

In [49]:
student_data.describe()

               id  percentage
count  100.000000  100.000000
mean    50.500000    5.235000
std     29.011492    2.494656
min      1.000000    1.000000
25%     25.750000    3.475000
50%     50.500000    5.300000
75%     75.250000    7.125000
max    100.000000    9.900000

In [50]:
print(student_data.describe())

               id  percentage
count  100.000000  100.000000
mean    50.500000    5.235000
std     29.011492    2.494656
min      1.000000    1.000000
25%     25.750000    3.475000
50%     50.500000    5.300000
75%     75.250000    7.125000
max    100.000000    9.900000

In [51]:
student_data[['email','name']].head()

                    email            name
0        cjopke0@ucsd.edu   Chariot Jopke
1        zdan1@oracle.com      Zorana Dan
2       krumble2@tamu.edu     Kurt Rumble
3  eyandell3@bluehost.com   Ethyl Yandell
4      abolzen4@lycos.com  Aeriela Bolzen

In [52]:
student_data['percentage'].describe()

count    100.000000
mean       5.235000
std        2.494656
min        1.000000
25%        3.475000
50%        5.300000
75%        7.125000
max        9.900000
Name: percentage, dtype: float64

In [53]:
import pandas as pd

# Create a simple dataframe by reading a CSV file
df = pd.read_csv("marks.csv")
print(df.head())

   student_id               Name  Math  Science  English  Total Grade
0           1     Mathias Cupitt    32       24       79    135     D
1           2       Nani Tromans    21       42       89    152     C
2           3     Adey Gulleford    55       43        4    102     D
3           4   Constantia Place    77       54       61    192     C
4           5  Scarface Olivetti    87       31       33    151     C

In [54]:
df.isna()

    student_id   Name   Math  Science  English  Total  Grade
0        False  False  False    False    False  False  False
1        False  False  False    False    False  False  False
2        False  False  False    False    False  False  False
3        False  False  False    False    False  False  False
4        False  False  False    False    False  False  False
..         ...    ...    ...      ...      ...    ...    ...
95       False  False  False    False    False  False  False
96       False  False  False    False    False  False  False
97       False  False  False    False    False  False  False
98       False  False  False    False    False  False  False
99       False  False  False    False    False  False  False

[100 rows x 7 columns]

In [55]:
df.isnull()

    student_id   Name   Math  Science  English  Total  Grade
0        False  False  False    False    False  False  False
1        False  False  False    False    False  False  False
2        False  False  False    False    False  False  False
3        False  False  False    False    False  False  False
4        False  False  False    False    False  False  False
..         ...    ...    ...      ...      ...    ...    ...
95       False  False  False    False    False  False  False
96       False  False  False    False    False  False  False
97       False  False  False    False    False  False  False
98       False  False  False    False    False  False  False
99       False  False  False    False    False  False  False

[100 rows x 7 columns]

In [56]:
df['Total'] = df[['Math','Science','English']].sum(axis=1) 
df[['Name','Math','Science','English','Total']].head()

                Name  Math  Science  English  Total
0     Mathias Cupitt    32       24       79    135
1       Nani Tromans    21       42       89    152
2     Adey Gulleford    55       43        4    102
3   Constantia Place    77       54       61    192
4  Scarface Olivetti    87       31       33    151

In [57]:
def assign_grade(total):
    if total >= 250:
        return 'A'
    elif total >= 200:
        return 'B'
    elif total >= 150:
        return 'C'
    else:
        return 'D'

In [58]:
df['Total'] = df[['Math','Science','English']].sum(axis=1)
# print(df[['Name','Total']])

df['Grade'] = df['Total'].apply(assign_grade)

In [59]:

print(df[['Name','Total','Grade']])

                        Name  Total Grade
0             Mathias Cupitt    135     D
1               Nani Tromans    152     C
2             Adey Gulleford    102     D
3           Constantia Place    192     C
4          Scarface Olivetti    151     C
..                       ...    ...   ...
95  Guenevere Scotchbourouge    138     D
96           Annmarie Stripp    160     C
97            Koressa Lemary    153     C
98           Annamarie Eller    148     D
99             Monroe Ledley     39     D

[100 rows x 3 columns]

In [60]:
grade_a_student = df[df['Grade'] == 'A']
print(grade_a_student)
print('No. of students failes: ',len(df[df['Grade'] == 'D']))

    student_id           Name  Math  Science  English  Total Grade
24          25  Duncan Vondra    93       84       97    274     A
No. of students failes:  52

In [61]:
math_max = max(df['Math'])
print('Max marks in Math: ', math_max)

Max marks in Math:  100

In [62]:
print(df[df['Math'] == math_max])

    student_id                 Name  Math  Science  English  Total Grade
29          30  Hieronymus Kynforth   100       47       38    185     C
92          93     Janaya Mawhinney   100       88       55    243     B

In [63]:
df.to_csv('new_marks.csv',index=False)
print('Data saved to new_marks.csv')

Data saved to new_marks.csv

In [64]:
import pandas as pd

df = pd.read_csv("sales_data.csv")

df['Total_amount'] = df['Quantity'] * df['Price']

print(df[['Product_Name','Total_amount']])

              Product_Name  Total_amount
0         Pantech Discover       12812.4
1    BlackBerry Curve 8300       30045.9
2            Sharp Aquos V        5106.0
3             Samsung F500       45875.5
4              Wiko Lenny2        8716.2
5       Sony Ericsson W380        8696.3
6            BLU Deejay II        8986.6
7       Huawei Watch GT 2e        4202.5
8                 NEC e232        4950.0
9                Telit T90       23381.6
10            Samsung E620       18636.8
11  Huawei MediaPad M6 8.4       14283.0
12   BlackBerry Curve 9320       26047.6
13                LG KG195       29866.8
14           alcatel Watch       11209.8
15        Acer Liquid E600        4019.2
16           Plum Sync 5.0        7790.6
17          alcatel OT-209       28073.2
18   Realme C3 (3 cameras)       21999.3
19         Lenovo K10 Plus       31143.5

In [65]:
orders_above_10000 = df[df['Total_amount'] > 10000]
print(orders_above_10000)

    order_id            Product_Name    Category  Quantity        Date  \
0       1001        Pantech Discover     Pantech         3  18/12/2024
1       1002   BlackBerry Curve 8300  BlackBerry         3  07/03/2024
3       1004            Samsung F500     Samsung         5  10/10/2024
9       1010               Telit T90       Telit         2  26/09/2024
10      1011            Samsung E620     Samsung         4  11/05/2024
11      1012  Huawei MediaPad M6 8.4      Huawei         2  23/11/2024
12      1013   BlackBerry Curve 9320  BlackBerry         4  09/02/2025
13      1014                LG KG195          LG         4  11/05/2024
14      1015           alcatel Watch     alcatel         2  15/04/2024
17      1018          alcatel OT-209     alcatel         4  22/04/2024
18      1019   Realme C3 (3 cameras)      Realme         3  15/04/2024
19      1020         Lenovo K10 Plus      Lenovo         5  07/06/2024

    Total_amount    Price
0        12812.4   4270.8
1        30045.9  10015.3
3        45875.5   9175.1
9        23381.6  11690.8
10       18636.8   4659.2
11       14283.0   7141.5
12       26047.6   6511.9
13       29866.8   7466.7
14       11209.8   5604.9
17       28073.2   7018.3
18       21999.3   7333.1
19       31143.5   6228.7

In [ ]:
most_sold_product = df.groupby('Product_Name')['Quantity'].sum().idxmax()
print(most_sold_product)

Lenovo K10 Plus

In [69]:
total_sales = df.groupby('Category')['Total_amount'].sum()
print(total_sales)

Category
Acer           4019.2
BLU            8986.6
BlackBerry    56093.5
Huawei        18485.5
LG            29866.8
Lenovo        31143.5
NEC            4950.0
Pantech       12812.4
Plum           7790.6
Realme        21999.3
Samsung       64512.3
Sharp          5106.0
Sony           8696.3
Telit         23381.6
Wiko           8716.2
alcatel       39283.0
Name: Total_amount, dtype: float64